Revit 2015 API
AnalyticalModel.HasAlignment Method
 Checks if analytical alignment is applicable at a given end.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2012
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2015. Since 2015 all elements of AnalyticalModelStick class support alignment. So if the element is an AnalyticalModelStick, it supports alignment.")]
public bool HasAlignment(
	AnalyticalDirection direction
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2015. Since 2015 all elements of AnalyticalModelStick class support alignment. So if the element is an AnalyticalModelStick, it supports alignment.")> _
Public Function HasAlignment ( _
	direction As AnalyticalDirection _
) As Boolean
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2015. Since 2015 all elements of AnalyticalModelStick class support alignment. So if the element is an AnalyticalModelStick, it supports alignment.")]
public:
bool HasAlignment(
	AnalyticalDirection direction
)
Parameters
direction
Type: Autodesk.Revit.DB.Structure.AnalyticalDirection
 The direction of the analytical model.
Return Value
 True if analytical alignment is supported.
Remarks
 True for analytical models of linear elements (beams, braces, columns).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace